Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: གང་བདག་གིས་དེའི་བར་ཆད་བྱའོ་སྙམ་ནས།
en: How can I prevent that?’

source: དེ་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་མངོན་པར་སྤྲུལ་ནས་འཁོར་གྱི་ནང་དུ་ཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་གི་ནང་དུ་འདུག་ནས་
en: He then made himself appear as the buddha and in that way entered the assembly of bodhisattvas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་དག་པར་ལྡན་པའི་གཏམ་ངན་པ་བསྔགས་ལ། འདོད་པའི་ཡོན་ཏན་དང་ཡང་དག་པར་ལྡན་པའི་གཏམ་ཟེར་རོ། །
en: Once among them he began to denigrate omniscience and instead talk about the pleasures of the senses.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཡང་འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་དག་ཉེ་བར་འབུལ་ཏེ།
en: He would also offer sense pleasures to the bodhisattvas,

source: མིག་གིས་བལྟ་བར་བྱ་བ་གཟུགས་མང་པོ་དང་། བཟའ་བ་དང་། བཅའ་བའི་ཡོ་བྱད་དང་། མེ་ཏོག་གི་ཡོ་བྱད་དང་། བལྡག་པའི་ཡོ་བྱད་དང་། རོལ་མོའི་ཡོ་བྱད་དང་། གླུ་དབྱངས་ཀྱི་ཡོ་བྱད་དང་། གར་གྱི་ཡོ་བྱད་རྣམས་འབུལ་བར་བྱེད་དོ། །
en: thus providing them with an abundance of things to look at, eat, and drink, as well as floral articles, snacks, and instruments for music, song, and dance.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བའི་སྟོབས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་བདག་གིས་བདུད་ཤུགས་འཆང་འདི་བདག་གི་ཤུགས་ཀྱིས་གདུལ་བར་བྱའོ་སྙམ་ནས།
en: “The bodhisattva Bold Strength thought that he would have to tame the māra Vegadharin with force.

source: འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱེད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུས་བྱས་པས་བདུད་ཤུགས་འཆང་གི་མགུལ་དུ་ཁྱི་རོ་ཞིག་བཏགས་སོ། །
en: He therefore performed a magical feat whereby a dog’s corpse became tied to the neck of the māra.

source: ཤུགས་འཆང་གི་གཟུགས་ཀྱིས་བདུད་ཀྱི་གནས་དེར་སོང་ངོ་། །
en: Meanwhile the bodhisattva assumed the form of Vegadharin himself

source: སོང་ནས་བདུད་ཀྱི་གནས་དེར་ཞུགས་ཏེ།
en: and thus he entered the realm of the māras and took up residence there.

source: ལྷའི་བུ་མོ་ཁྲི་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དག་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །
en: While in the land of the māras, he made nine hundred ninety thousand divine maidens embrace awakening.

source: དེ་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་ལྡན་པའི་གཏམ་དེ་ལྟ་བུ་དག་ཀྱང་བྱས་ཏེ། འདི་ལྟར་ལྷའི་བུ་མོ་ཁྲི་ཕྲག་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Speaking to them about the nature of the bodhisattva, he caused all these thousands of divine maidens to become irreversible from unsurpassed and perfect buddhahood.

source: ལྷའི་བུ་མོ་ཁྲི་ཕྲག་དེ་དག་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་བཙུད་ནས། བདུད་ཀྱི་གནས་དེ་ཉིད་དུ་འདོད་པའི་ཡོན་ཏན་ལྔ་དག་གིས་བདག་ཉིད་རྩེ་བ་མངོན་པར་སྤྲུལ་ཏོ། །
en: Having guided all these divine maidens to the irreversible stage, he then, within the very realm of the māras, created a display for frolicking in the pleasures of the five senses.

source: དེ་ནས་བདུད་ཤུགས་འཆང་ཁྱི་རོ་བཏགས་པ་དེ་རང་གི་གནས་ག་ལ་བ་དེར་སོང་བ་དང་། གནས་དེ་ན་ལྷའི་བུ་དང་། ལྷའི་བུ་མོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་ཡོངས་སུ་སྤྱོད་པ་མཐོང་ངོ་། །
en: As the māra Vegadharin, who still had the dog corpse tied to him, returned to his homeland he saw gods and goddesses engaged together in playful enjoyments.

source: མཐོང་ནས་ཀྱང་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ལ། བློང་བློང་པོར་གྱུར་ཅིང་དེར་མི་དགའོ། །
en: To Vegadharin this sight was painful and distressing, and he became upset and unhappy.

source: དེ་ནས་ལྷའི་བུ་མོ་ཁྲི་ཕྲག་དགུ་བཅུ་པོ་དེ་དག་བདུད་ཤུགས་འཆང་བློང་བློང་པོར་གྱུར་པར་རིག་ནས། སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ཏེ།
en: “When the nine hundred thousand divine maidens noticed the upset māra Vegadharin they felt great compassion.

source: བདུད་ཤུགས་འཆང་འདི་སྲོག་ཆགས་རྣམས་ཀྱི་ཕྱིར་སྡིག་པའི་རོས་བློང་བློང་པོར་གྱུར་ཅིང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མི་ཤེས་པ་ལ་ལྟོས།
en: ‘Behold the māra Vegadharin!’ they cried. ‘Carrying an evil corpse, he is upset with living beings and bereft of knowledge of the way things are.

source: ཀྱེ་ཨེ་མ་སློབ་དཔོན་དཔའ་བའི་སྟོབས་བདུད་ཤུགས་འཆང་འདི་བདག་ཅག་གི་བདུད་ཀྱི་གནས་ལ་དབང་ཕྱུག་གི་དབང་གིས་བགེགས་བགྱིད་པར་འགྱུར་ན། བདག་ཅག་ལ་འཚེ་བར་མི་འགྱུར་བར་མཛད་དུ་གསོལ།
en: O master, Bold Strength, if this māra Vegadharin should create obstacles by taking control of our māra realm, please ensure that we remain unharmed.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བའི་སྟོབས་ཀྱིས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱེད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུས་བྱས་པས་བདུད་ཤུགས་འཆང་གི་གནས་ཀྱི་གོང་དུ་བདུད་ཀྱི་གནས་གཞན་ཆེས་རྫུ་འཕྲུལ་ཆེ་བ། ཆེས་གཟི་བརྗིད་ཆེ་བ། ཆེས་མཐུ་ཆེ་བ། ཆེས་གཟི་ཆེ་བ་ཞིག་མངོན་པར་སྤྲུལ་ཏོ། །
en: “The bodhisattva Bold Strength now produced another miraculous feat, and thus created a second māra realm above that of Vegadharin’s, yet vastly superior in terms of miraculous displays, splendor, power, and glory.

source: འཇིག་རྟེན་གྱི་ཁམས་གཞན་ཞིག་ཀྱང་མངོན་པར་སྤྲུལ་ཏེ། དེར་བདུད་དེ་དབང་ཕྱུག་ལ་དབང་བྱེད་དེ། དེས་གནས་དེ་དང་བདུད་དེ་ཡང་ཐལ་བར་བརླགས་སོ། །
en: Thereupon he created a third realm, also controlled by māras. That third realm then obliterated the second realm, and all of its māras.

source: དེ་ནས་བདུད་ཤུགས་འཆང་གིས་བདུད་དེ་དང་བདུད་ཀྱི་གནས་དེ་མཐོང་ནས་ཡིད་གཉིས་སུ་གྱུར་ཏེ། བདག་ཀྱང་ཡུན་མི་རིང་བར་འཆི་བའི་ཆོས་སུ་འགྱུར་རོ། །
en: “When the māra Vegadharin perceived this, he became doubtful and thought to himself, ‘I too may soon die.

source: བདུད་ཀྱི་གནས་འདིས་བདག་གི་ངོ་བོ་དང་། ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་དང་ཐ་དད་པའི་ངོ་བོར་འགྱུར་རོ་སྙམ་མོ། །
en: This whole realm of māras may end up annihilating me and all of my belongings.’

source: གནས་དེ་དག་གིས་དེ་ཀུན་ཏུ་སྐྱོ་བར་གྱུར་ཅིང་ཡིད་མི་དགའ་བར་གྱུར་ནས། འཇིགས་སྐྲག་བློང་བློང་པོར་གྱུར་ནས་བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བའི་སྟོབས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Becoming weary with those realms, he then spoke to the bodhisattva Bold Strength out of fear and worry:

source: མཁས་པ་མགོན་མེད་མགོན་མཛོད་རྣམ་པར་ལྟུང་ལས་དགྲོལ་བར་མཛོད། །
en: “ ‘Master, please be the protector of those who have none; please save us from all downfalls.

source: བྱིས་པའི་ངོ་བོ་བདག་གིས་མི་དགེ་གང་བགྱིས་མི་རྟག་པས། །སྲིད་པར་འགྲོ་བ་ཀུན་གནོད་རྟག་པ་མ་ལུས་མཐོལ་ཞིང་མཆིས།
en: All the negativity that I, the childish one, have done is impermanent, So I confess my constant harm to wandering beings in the realms of existence.

source: རྣམ་འཇིག་ཆོས་ཀྱི་དངོས་པོ་ཅུང་ཟད་མགོན་སྐྱབས་བགྱིད་མ་མཆིས། །
en: Things that are subject to destruction cannot at all serve as refuge or protection.

source: རྣམ་འཇིག་ཆོས་ཀུན་བདག་གིས་རྣམ་སྤང་བདག་ཀྱང་མ་གྲོལ་བ། །
en: “ ‘All that is subject to destruction I must separate from, and yet I remain unfree.

source: འདི་ལྟར་བཟོད་པར་མཛོད་ཅིག་དཔའ་སྟོབས་བདེ་བར་གཤེགས་པའི་སྲས། །
en: O Bold Strength, son of the blissful ones, please bear with me!

source: རྟབས་ལ་སྐྲག་ཅིང་ཉམས་པས་དེ་ཡི་ཡིད་ཀྱི་སྐྱོ་བ་ཆད། །
en: Frightened and distressed, I beg you to dispel my gloom.

source: ང་རྒྱལ་རྣམ་སྤངས་རྒྱལ་བའི་སྲས་ལ་ཐམས་ཅད་སྐྱབས་སུ་ཞུགས། །
en: Leaving behind my pride, I ask the victorious ones’ son to be my refuge in all.

source: གང་གིས་རྒུད་འཇིགས་ཡོངས་མཐོང་འདི་ལྟར་ཁྱོད་ལ་སྐྱབས་སུ་མཆིས། །
en: “ ‘He who has witnessed destruction seeks refuge in you!

source: རྒྱལ་སྲས་མཁས་པ་སྡུག་བསྔལ་ཉམས་པ་དག་ལས་བདག་ལ་སྐྱོབས། །
en: Skillful son of the victors, please save me from suffering and decay!’

source: ཤུགས་འཆང་སྐྱོ་བ་རྒྱལ་བའི་སྲས་ཀྱིས་གཟིགས་ནས་དེས་སྨྲས་པ། །
en: Seeing Vegadharin’s pain, the son of the victorious ones replied:

source: གྲོགས་པོ་རྒྱལ་བའི་སྲས་ལ་བགེགས་མ་བྱེད་ཅིང་ང་རྒྱལ་སྤོངས། །
en: ‘My friend, do not hinder the victorious ones’ children, and give up your pride.

source: སྲིད་ཀུན་མི་རྟག་ཡོངས་སུ་འཛིན་ལ་མངོན་པར་ཞེན་པ་ཐོང་། །
en: “ ‘The whole world is impermanent, so abandon your attached grasping.

source: སེམས་ནི་མངོན་པར་དད་པས་ངེས་པར་འབྱུང་བ་རབ་ཏུ་ཤེས། །
en: The mind of faith understands deliverance.

source: སེམས་ཅན་གང་ཡང་འཁྲུགས་པའི་ཡིད་ཀྱི་ཆོས་ཞེས་ནམ་ཡང་མེད། །
en: When their minds are upset there is no Dharma for sentient beings,

source: ཡིད་ཀྱི་རྙོག་པ་བསལ་བཏང་རྒྱལ་བ་མཆོག་གིས་བསྟན་པ་མཐོང་། །
en: But as they dispel their minds’ murk they perceive the teaching of the supreme victors.’

source: རྒྱལ་སྲས་བདག་སེམས་རྙོག་པ་བྲལ་ཞིང་ཡིད་ཀྱིས་རྣམ་པར་འབད། །
en: “ ‘I strive, O son of the victorious ones, to free my mind from its murk.

source: རྒྱལ་བའི་རིམ་གྲོ་བགྱིད་ཀྱིས་རྒྱལ་བའི་གསུང་དག་གསུངས་ཤིག་གསུངས། །
en: And I worship the victorious ones, so please do speak the words of the victors.’

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་བྱང་ཆུབ་སེམས་ལ་བདུད་ཉོན་ཅིག །
en: “ ‘Listen, māra, about the thus-gone ones’ qualities and the mind of awakening!

source: བདེ་གཤེགས་སྲས་ལས་གང་དག་ཐོས་པ་བདུད་ཀྱི་ཞགས་པ་གཅོད། །
en: The speech of the thus-gone ones’ children cuts through the māras’ shackles.

source: རྒྱལ་བས་རབ་གསུངས་ཆོས་ཉིད་མི་གཡོ་འགྱུར་མེད་ཆོས་ཀྱི་དབྱིངས། །
en: The victorious ones teach the immutable intrinsic nature, the realm of reality.

source: རྒྱལ་བའི་སྲས་འདི་ཤེས་ན་རྒྱལ་བས་མཆོད་པ་བྱས་པར་འགྱུར། །
en: When the victors’ children understand this they receive the victors’ worship.

source: གང་དག་བློ་ངེས་མེད་པ་སོ་སོའི་སྐྱེ་བོ་བྱིས་པ་ཞེས། །
en: “ ‘Minds that lack certainty are known as “childish, ordinary beings,”

source: བྱ་སྟེ་དེ་ལྟར་སེམས་ངེས་མེད་པ་ཀུན་རྟོག་རླུང་དང་འདྲ། །
en: And in such uncertain minds thinking moves like the wind.

source: གང་དག་རྒྱལ་བའི་གསུང་ནི་རྣམ་ཤེས་དེ་དག་བདུད་ཀྱི་ཞགས། །རླུང་གི་སྟོབས་ཀྱིས་ཕུབ་མ་ཕྱར་ལྟར་མ་ལུས་ཤིན་ཏུ་བཅོམ། །
en: In such consciousness the speech of the victorious ones Will destroy the shackles of the māras, as when the wind winnows the grain.

source: འགྱུར་མེད་ཆོས་དབྱིངས་སྟོང་པ་མི་གཡོ་གཉིས་མེད་སྨྲས་པ་ནི། །
en: “ ‘The teaching of the unchanging realm of reality is empty, immutable, and non-dual.

source: བདུད་སྟོབས་འཇོམས་པར་བྱེད་ཅིང་བདུད་དབང་སོང་བས་ཤེས་པར་དཀའ། །
en: Hard to comprehend, it crushes the māras’ power and controls them.

source: སེམས་ཅན་གང་དག་སྐྱེས་དང་འཆི་དང་འབྱུང་བ་གང་ཡང་མེད། །
en: There are no sentient beings who take birth, die, or emerge.

source: ཀུན་ཏུ་འཕོ་བ་མེད་ཅིང་ལས་དང་ལྟུང་བའང་ཡོད་པ་མ་ཡིན་ཏེ། །
en: There is no transference, nor any karma or downfall.

source: སྟོང་ཉིད་རྟོག་པར་བྱེད་ན་རྒྱལ་བའི་སྲས་དག་ཡིད་མི་རྨོངས། །
en: “ ‘Comprehending emptiness, the minds of the victors’ children are undeluded.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིས་ཆོས་འདི་ཀུན་ལ་བྱེད་པ་པོ། །
en: Due to error, all these phenomena are produced.

source: ལས་དང་རྣམ་སྨིན་ཀུན་རྟོག་མི་མཁས་བདུད་ཀྱི་ཞགས་པས་འཆིང་། །
en: Karma, ripening, and thought are māras’ shackles, which bind the deluded.

source: ཀྱེ་མ་ཇི་ལྟར་སྐུད་མདུད་གཟིངས་པའི་སྐུད་པ་རྣམ་གྲོལ་ལྟར། །
en: Ah, this is like the unraveling of threads tangled in a knot.

source: དེ་བཞིན་འདོད་ཆགས་མ་བྲལ་ཆོས་ལ་འདོད་ཆགས་བཅས་མཐོང་འཆིང་། །
en: “ ‘Those not free from desire will perceive things in terms of desire and be bound,

source: དེ་ཡིས་སྡུག་བསྔལ་མྱོང་སྟེ་འདིར་ནི་སྡུག་བསྔལ་གང་ཡང་མེད། །
en: Yet while they experience suffering there is no suffering at all.

source: གང་དག་རྒྱལ་བའི་གསུང་ལ་ཐེ་ཙོམ་མེད་ཡིད་དེ་འཆིང་མེད། །
en: The minds of those who have no doubt about the victors’ teaching will not be bound.

source: མར་མེ་གང་དག་ཟད་ལྟར་དེ་ནི་མ་ལུས་མྱ་ངན་འདའ། །
en: Like candles burning out, they all go beyond suffering.

source: འགྲོ་ལ་ཕན་བརྩོན་རྣམ་འདྲེན་བརྟན་པ་འགྲོ་བ་དེ་མི་གསུང་། །
en: “ ‘The guides who strive for beings’ benefit do not teach about beings.

source: མེ་འབར་ཞི་ལྟར་འགྲོ་བ་མེད་ཅེས་རྒྱལ་སྲས་དཔའ་བའི་ཚིག །
en: Like a fire that has died, there are no beings.’

source: འདི་ལྟར་དེ་ཚེ་འདི་དག་ཐོས་ནས་བདུད་དེ་དགའ་བར་འགྱུར། །
en: So said the bold son of the victors, which made the māra joyful.

source: དེ་བཞིན་སྟོབས་བཅུའི་སྐྱབས་སུ་སོང་ཞིང་སྟོབས་བཅུའི་སྤྱོད་པའང་སྒྲུབ། །
en: Taking refuge in the ten powers of the thus-gone ones, he accomplished their practices.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བའི་སྟོབས་ཞེས་བྱ་བར་གྱུར་པ། དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Bold Strength was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བའི་སྟོབས་ཞེས་བྱ་བར་གྱུར་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་པར་ཤེས་སོ། །
en: In those days I was the bodhisattva Bold Strength and thus I realized the knowledge of cessation as related to knowledge of the various inclinations of sentient beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must train in the knowledge of cessation as related to knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་ངས་མོས་པ་སྣ་ཚོགས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone, worthy, perfect buddha named Bhaiṣajyarāja;

source: རིག་པ་དང་། ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་། མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ། དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར། བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་མཚུངས་པ་མེད་པ་ཞེས་བྱ་བ། དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། ཡུན་རིང་དུ་ཚངས་པར་སྤྱོད་པ་ཞིག་བྱུང་སྟེ
en: “In the buddha realm of the thus-gone Bhaiṣajyarāja there was a bodhisattva by the name of Incomparable Strength, who had created roots of virtue before innumerable thus-gone ones, and who had for long been observing pure conduct.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེའི་རིམ་གྲོ་པ་ཡིན་ལ། དོན་ཤེས། ཆོས་ཤེས། དུས་ཤེས། ཚོད་ཤེས། བདག་ཤེས། འཁོར་ཤེས། གང་ཟག་མཆོག་དང་། མཆོག་མ་ཡིན་པ་དང་། ཡ་མཚན་ཅན་ཐམས་ཅད་ཀྱི་གྲུབ་པའི་མཐའ་དང་། བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་གྲུབ་པའི་མཐའ་དང་། བཟོའི་གནས་ཐམས་ཅད་ཀྱི་གྲུབ་པའི་མཐའ་ཤེས་ཏེདེ་ལྟར་འདིར་ཡུན་རིང་དུ་ཤེས་པ་སྤྱད་དོ། །
en: The bodhisattva Incomparable Strength served the thus-gone Bhaiṣajyarāja, and he had for long pursued knowledge of meanings, phenomena, times, limits, selves, retinues, supreme persons, common persons, the tenets of all the heretical schools, all the tenets found in the treatises, and all the tenets of the arts and crafts.

source: དེ་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེའི་དྲུང་དུ་སོང་ནས་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: This bodhisattva went before the thus-gone Bhaiṣajyarāja, bowed his head to his feet, and stood to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་མཚུངས་པ་མེད་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: From there he made the following request in the form of a song in verse:

source: རྣམ་པར་འདྲེན་པ་མཆོག་བརྙེས་པ། །གླང་ཆེན་ཁྱོད་ལ་ཞུ་བ་ནི། །སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་ཤེས། །རྒྱུ་གང་གིས་ནི་ཞི་བར་འགྱུར། །
en: “ ‘Guide and discoverer of the supreme, Great elephant, from you I request Knowledge of the faculties of beings, And of the causes for their pacification.

source: ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་གཤེགས། །
en: “ ‘You who have gone beyond all phenomena,

source: བདག་གིས་ཞུས་པ་དེ་དག་གསུངས། །
en: Please explain these topics to me.

source: གང་དག་ཤེས་པ་དེ་ཡི་རྒྱུ། །ཐོས་ནས་འབད་པར་བགྱིད་པར་འགྱུར། །
en: Having heard the causes of knowledge I shall pursue them.’

source: འཇིག་རྟེན་སྟོན་པ་མཁས་པ་སྟེ། །ཐམས་ཅད་མཁྱེན་པ་འཇིགས་མི་མངའ། །
en: “The skillful teachers of the world Have knowledge of all and are free from fear.

source: ཇི་ལྟར་རྒྱལ་བའི་སྲས་ཀྱིས་ཞུས། །རྐང་གཉིས་མཆོག་གིས་དེ་ལུང་བསྟན། །
en: Whatever the victors’ children may ask, The supreme beings will give a reply.

source: གང་དག་ཐམས་ཅད་མཁྱེན་པ་ཡི། །མི་མཆོག་སེམས་ནི་སྐྱེད་བྱེད་ན། །དེ་ལྟར་དེར་ནི་ནང་དུ་ཞུགས། །དབང་པོ་དག་ཀྱང་ཉེ་བར་ཞི། །
en: “ ‘The one who brings forth the omniscient mind Of the one supreme among humans, Will remain in composure With all faculties serene.

source: གང་དག་ཤེས་པ་དེ་ལ་འཇུག །འགྲོ་བ་འབྱང་ཞིང་ཟད་པར་འགྱུར། །
en: “ ‘Whoever develops such knowledge Will purify the world and exhaust it.

source: ཟད་པ་དེ་ལ་གང་ཤེས་པ། །འདི་ཡིས་དེ་ནི་འགག་པར་འགྱུར། །
en: Whoever comprehends exhaustion Will thereby achieve cessation.’

source: དེ་ཡིས་དེ་ནི་ལུང་བསྟན་པ། །རྒ་ནད་སྐྱེ་བ་མེད་པ་ཡིས། །ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར། །
en: “Then, as he received these explanations, He became free from old age, sickness, and birth, And attained acceptance of the Dharma.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་མཚུངས་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Incomparable Strength was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་མཚུངས་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Incomparable Strength.

source: དགེ་བའི་རྩ་བ་དེས་ང་མོས་པ་སྣ་ཚོགས་ཤེས་པ་ཐོབ་བོ། །
en: By the power of those roots of virtue I attained knowledge of the various inclinations.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་དུ་བྱེད་པར་འདོད་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྟོགས་པར་བྱ་བ་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to actualize the knowledge of the path that leads to cessation as related to knowledge of the various inclinations must endeavor to realize omniscient wisdom.”

source: མཽད་གལ་གྱི་བུ་ངས་དབང་པོ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the faculties.

source: བྲམ་ཟེ་སྒྲ་རྣམ་པར་གྲགས་པ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་བྱུང་སྟེ། རིག་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། སྦྱིན་པ་པོ་སྦྱིན་བདག་ཆོས་ཀྱི་སྡུད་པ་དང་། ཟང་ཟིང་གི་སྡུད་པས་ཤིན་ཏུ་སྡུད་པ་ཞིག་བྱུང་ངོ་། །
en: This brahmin was like a great sal tree, a master of all the sciences, and a great donor and benefactor, both in terms of Dharma and material things.

source: དེ་ཐམས་ཅད་མཁྱེན་པའི་ཤེས་པ་རྟོགས་པར་བྱ་བ་ལ་བརྩོན་ནོ། །
en: He endeavored to realize the omniscient mind.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་སྒྲིབ་མེད་ལུང་སྟོན་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At that time there was a thus-gone known as Stainless Teacher.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་ཚེའི་ཚད་དཔག་ཏུ་མེད་པར་གྱུར། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དག་བྱུང་། སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་དག་བྱུང་། ཉན་ཐོས་འདུས་པ་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །
en: His lifespan was boundless, and his saṅgha of hearers, his buddha realm, and his assembly of hearers were all immense.

source: བྲམ་ཟེ་སྒྲ་རྣམ་པར་གྲགས་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་དེ་བཞིན་གཤེགས་པ་སྒྲིབ་མེད་ལུང་སྟོན་ཐོས་སོ། །
en: The brahmin Famous Sound, who was like a great sal tree, had heard of the thus-gone Stainless Teacher,

source: ཐོས་ནས་བྲམ་ཟེ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྒྲིབ་མེད་ལུང་སྟོན་དེའི་དྲུང་དུ་དོང་སྟེ་ཕྱིན་ནས།
en: and so he went before him together with nine hundred eighty million other brahmins.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྒྲིབ་མེད་ལུང་སྟོན་དེ་ལ་མཆོད་པ་འདི་ལྟ་བུ་དག་བྱེད་དེ།
en: Once there, they presented offerings to the blessed thus-gone Stainless Teacher.

source: ཐམས་ཅད་དང་ལྡན་པའི་བར་སྣང་ལ་ནོར་བུའི་བླ་རེ་ཀུན་ཏུ་བྲེས། ཐམས་ཅད་དང་ལྡན་པའི་ས་གསེར་གྱི་གླེགས་མས་ཀུན་ཏུ་གཡོགས།
en: In the sky above they unfolded a bejeweled canopy and on the ground below they spread a golden floor.

source: གསེར་གྱི་ཁང་པ་བརྩེགས་པ་འཕང་དུ་དཔག་ཚད་གཅིག་ཙམ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་གནས་བཅུར་ཀུན་དུ་བརྒྱན་ཏེ།
en: They then ornamented the ten directions with eighty thousand golden mansions, each a league tall.

source: ཁང་པ་བརྩེགས་པ་རེ་རེ་ཡང་བུ་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་སྟོང་དག་མངོན་པར་འཛེག་གོ། །
en: Within each one of them resided thousands of ladies richly adorned with jewelry,

source: ཁང་པ་བརྩེགས་པ་རེ་རེའི་ས་ལ་ཡང་སིལ་སྙན་སྟོང་གི་སྒྲ་དབྱངས་འབྱུང་ངོ་། །
en: and from each of the buildings came the melodious sounds of thousands of cymbals.

source: ཁང་པ་བརྩེགས་པའི་ས་ཐམས་ཅད་དུ་མེ་ཏོག་ཁ་དོག་རྣམ་པ་ལྔ་དག་བཀྲམ།
en: On the ground bloomed flowers of five colors,

source: ཁང་པ་བརྩེགས་པའི་ས་ཐམས་ཅད་དུ་ལྷའི་སྤོས་དང་ལྡན་པ་དག་གིས་བྱུགས།
en: [On the ground] divine perfumes filled the air,

source: ལྷའི་བདུག་སྤོས་དག་གིས་བདུགས་ཤིང་བདུག་པར་བྱེད་དེ། ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་བདུག་པས་འཁྲིགས་པར་གྱུར།
en: and the mansions were fragrant and delightfully scented with divine incense.

source: སྤོས་དང་སྤོས་དག་དང་བདུག་པ་དག་གིས་དྲེགས་པར་གྱུར། སྤོས་དང་། བདུག་པ་དག་གིས་དགའ་བར་གྱུར་ཏོ། །
en: Thus, all the mansions were pleasant and delightful due to the scent of incense and perfume.

source: སངས་རྒྱས་ཀྱི་མཐུས་ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མ་བཟུང་བར་བར་སྣང་ལ་འགྲོའོ། །
en: By the power of the Buddha, all the mansions rested in midair without being otherwise supported.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་ལས་སངས་རྒྱས་ལ་བསྟོད་པའི་སྒྲ་གྲག་ཆོས་ལ་བསྟོད་པའི་སྒྲ་གྲག །དགེ་འདུན་ལ་བསྟོད་པའི་སྒྲ་གྲག་གོ། །
en: From all of them came the sounds of praises to the Buddha, Dharma, and Saṅgha.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་སྒྲ་གྲག་གོ། །
en: Likewise, each of the houses resounded with words of emptiness, absence of marks, and absence of wishes;

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུའི་སྒྲ་གྲག་གོ། །
en: of the fruitions of the stream-enterer, once-returner, and non-returner;

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པའི་སྒྲ་གྲག་གོ། །
en: of impermanence, suffering, and the absence of self;

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་རྣམ་པར་གནས་པའི་སྒྲ་གྲག་གོ། །
en: of concentrations, freedoms, absorptions, and equilibriums;

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པའི་སྒྲ་གྲག་གོ། །
en: of miraculous powers ,

source: ལྷའི་མིག་དང་། ལྷའི་རྣ་བའི་སྒྲ་དང་། སེམས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྒྲ་དང་སྔོན་གྱི་གནས་ཀྱི་སྒྲ་གྲག་གོ། །འགོག་པའི་སྒྲ་གྲག་གོ། །
en: the divine eye, the divine ear, knowledge of the minds of others, and knowledge of past situations and of cessation.

source: ཁ་ཅིག་ནི་ཐར་པ་དང་འཐུན་པའི་སྒྲ་སྟེ།
en: In some places one would hear words that accord with liberation.

source: གང་དེ་དག་ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་ལས་གྲག་གོ། །
en: Such were the sounds that resounded from all of the mansions.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་བར་སྣང་ལས་འགྲོ་བའི་མདུན་དུ་ཡང་སྤོས་ཆུའི་ཆར་རབ་ཏུ་བབ་ཅིང་། ཡང་དག་པར་འདས་པའི་ལྷའི་མེ་ཏོག་གི་ཆར་རབ་ཏུ་བབ་བོ། །
en: From the sky where the mansions were fell rains of perfumed water and divine flowers that were otherworldly.

source: དེ་དེ་བཞིན་གཤེགས་པ་སྒྲིབ་མེད་ལུང་སྟོན་དེའི་སྤྱན་སྔར་འདུག་ནས་
en: As for the thus-gone Stainless Teacher’s throne, it was covered with five types of flowers.

source: སྐོན་པ་ཁྲི་མེ་ཏོག་སྣ་ལྔ་དག་གིས་བཀང་ནས་མངོན་པར་གཏོར་རོ། །
en: When flowers were cast in offering at the throne, the power of the Buddha made it so that none of the flowers landed on the ground.

source: གཏོར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་ས་ལ་མ་ལྷུང་ཞིང་སྟེང་དུ་མེ་ཏོག་གི་བླ་རེར་བྲེས་སོ། །
en: [When flowers were cast in offering at the throne] Instead they came to form a floral canopy above.

source: དེ་ནས་བྲམ་ཟེ་སྒྲ་རྣམ་པར་གྲགས་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེས་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་འདི་ལྟ་བུ་འདི་དག་མཐོང་ནས། ཇི་ལྟ་བུའི་དགེ་བའི་རྩ་བའི་ཤུགས་ཐོབ་པ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བའི་ཤུགས་ཐོབ་པས་ཤིང་ཏ་ལ་བདུན་སྲིད་དུ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་སོ། །
en: “As the brahmin Famous Sound, who was like a great sal tree, witnessed these miraculous events, the power of the roots of virtue attained thereby made him ascend into the air up to the height of seven palm trees.

source: དེ་བར་སྣང་ལ་སོང་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་དོ། །
en: From there he then spoke the following verses of praise to the Blessed One:
